Tekla Open API Reference for Tekla Structures 2025
AnalysisPartBarAttributes.BarStartCondition Property
 The bar start condition.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisPartEnd BarStartCondition { get; set; }
Public Property BarStartCondition As AnalysisPartEnd
	Get
	Set
Property Value
Type: AnalysisPartEnd
See Also
Reference
AnalysisPartBarAttributes Class
Tekla.Structures.Analysis Namespace